In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sn

In [12]:
hee = pd.read_csv("Cars_Data.csv",index_col=0,na_values=["??","???"])

In [13]:
hot = hee.copy()

In [11]:
too = pd.read_csv("titanic_train.csv",index_col=0,na_values=["??","???"])

In [14]:
tot = too.copy()

In [15]:
tot.head(2)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C

In [16]:
tot.dropna(axis=0,inplace= True)

In [17]:
tot.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 183 entries, 2 to 890
Data columns (total 11 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  183 non-null    int64
 1   Pclass    183 non-null    int64
 2   Name      183 non-null    object
 3   Sex       183 non-null    object
 4   Age       183 non-null    float64
 5   SibSp     183 non-null    int64
 6   Parch     183 non-null    int64
 7   Ticket    183 non-null    object
 8   Fare      183 non-null    float64
 9   Cabin     183 non-null    object
 10  Embarked  183 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 17.2+ KB

In [18]:
hot.dropna(axis=0,inplace= True)
# we using the dropna function for deleting the missing value

# Scatter Plot diagram
### we use:
- basic scatter plot using seaborn
- add regression line or of/on regression plot
- change the marker
- using the three parameter or catagory in scatter plot

In [19]:
hot.head(2)

,Model,Type,Origin,DriveTrain,MSRP,Invoice,EngineSize,Cylinders,Horsepower,MPG_City,MPG_Highway,Weight,Wheelbase,Length
Make,,,,,,,,,,,,,,
Acura,MDX,SUV,Asia,All,"$36,945","$33,337",3.5,6.0,265.0,17.0,23.0,4451.0,106.0,189.0
Acura,RSX Type S 2dr,Sedan,Asia,Front,"$23,820","$21,761",2.0,4.0,200.0,24.0,31.0,2778.0,101.0,172.0

In [20]:
hoo = pd.read_csv("toyota.csv",index_col= 0,na_values=["??","???"])

In [21]:
hot = hoo.copy()

In [22]:
hot.head(2)

       year  price transmission  mileage fuelType  tax   mpg  engineSize
model
 GT86  2016  16000       Manual    24089   Petrol  265  36.2         2.0
 GT86  2017  15995       Manual    18615   Petrol  145  36.2         2.0

## Basic scatter plot using seaborn
- I want to show you